In the previous assigment, we used pandas to create a column based of the value of one other column, for this excercise we will need to find a way to pass two columns through our boolean logic

In [2]:
import pandas as pd
import numpy as np
Location = "gradedata.csv"
df = pd.read_csv(Location)
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [9]:
df[['exercise','hours']]

      exercise  hours
0            3     10
1            4      4
2            5      9
3            2      7
4            4     15
...        ...    ...
1995         1      8
1996         4     18
1997         3     14
1998         1      7
1999         4     10

[2000 rows x 2 columns]

To pass two columns through our boolean logic, we leverage the numpy _where_ function, which allows us to pass multiple values as columns of our dataframe. It's important to stress that numpy is what allows us to pass two column values through our function.

In [ ]:
df['timemgmt'] = np.where((df['exercise']>3)
 & (df['hours']>17),'busy', 'available')

If we do a count on our values in _timemgt_, we can see which values fall within the levels of our new column, and we make sure the boolean was actually applied.

In [8]:
df.groupby(['timemgmt']).size()

timemgmt
available    1948
busy           52
dtype: int64